## 1. Create a Series containing the numbers 1 to 10, with the index labels "a" to "j".

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
# Creating a series
s=pd.Series(np.arange(1,11))

In [4]:
s.index=list("abcdefghij")

In [5]:
s

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

## 2. Create a DataFrame with 5 rows and 3 columns, containing random integers between 0 and 10.

In [6]:
# Creating a DataFrame with 5 rows and 3 columns 
df=pd.DataFrame(np.random.randint(0,11,(5,3)),columns=["Column1","Column2","Column3"])

In [7]:
df

   Column1  Column2  Column3
0        7        9        7
1        4        5        4
2        6        6        2
3        8       10        6
4        3        3        0

## 3. Load a CSV file into a DataFrame and display the first 5 rows.

In [8]:
# Loading a csv file
df=pd.read_csv("sample.csv")

In [9]:
df.head()

      Name  Age         City
0     John   25     New York
1     Jane   32  Los Angeles
2      Bob   45      Chicago
3    Emily   19      Houston
4  Michael   52      Phoenix

## 4. Select the first 3 rows of a DataFrame and return them as a new DataFrame.

In [10]:
# Selecting the first 3 rows
new_df=df.loc[0:2]
new_df

   Name  Age         City
0  John   25     New York
1  Jane   32  Los Angeles
2   Bob   45      Chicago

## 5. Select the last 2 columns of a DataFrame and return them as a new DataFrame.

In [11]:
# Selecting the last 2 columns
new_df=df.iloc[:,-2:]
new_df

   Age         City
0   25     New York
1   32  Los Angeles
2   45      Chicago
3   19      Houston
4   52      Phoenix
5   47     New York
6   23     Tulsipur

## 6. Select all rows where a specific column has a value greater than 30.

In [12]:
df

       Name  Age         City
0      John   25     New York
1      Jane   32  Los Angeles
2       Bob   45      Chicago
3     Emily   19      Houston
4   Michael   52      Phoenix
5  Benjamin   47     New York
6   Laxuman   23     Tulsipur

In [13]:
# Selecting all rows greater than 30
new_df=df.loc[df.Age>30]
new_df

       Name  Age         City
1      Jane   32  Los Angeles
2       Bob   45      Chicago
4   Michael   52      Phoenix
5  Benjamin   47     New York

## 7. Group a DataFrame by a specific column and calculate the mean of each group.

In [14]:
df

       Name  Age         City
0      John   25     New York
1      Jane   32  Los Angeles
2       Bob   45      Chicago
3     Emily   19      Houston
4   Michael   52      Phoenix
5  Benjamin   47     New York
6   Laxuman   23     Tulsipur

In [15]:
grouped=df.groupby('Name')
grouped

In [16]:
# df.mean(df.loc[df.Age],axis=1)
print(grouped.mean())

           Age
Name
Benjamin  47.0
Bob       45.0
Emily     19.0
Jane      32.0
John      25.0
Laxuman   23.0
Michael   52.0

/tmp/ipykernel_33224/666430223.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(grouped.mean())

## 8. Merge two DataFrames on a specific column.

In [17]:
# First DataFrame
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

In [18]:
# Second DataFrame
df2 = pd.DataFrame({'City': ['MUMBAI', 'PUNE', 'MUMBAI', 'DELHI'],
                    'Age': ['12', '13', '14', '12']})

In [19]:
result=pd.concat([df1,df2],axis=1)
result

    id Name    City Age
0  A01  ABC  MUMBAI  12
1  A02  PQR    PUNE  13
2  A03  DEF  MUMBAI  14
3  A04  GHI   DELHI  12

## 9. Sort a DataFrame by a specific column in descending order.

In [20]:
result.sort_values(by='Age',ascending=False,inplace=True)
result

    id Name    City Age
2  A03  DEF  MUMBAI  14
1  A02  PQR    PUNE  13
0  A01  ABC  MUMBAI  12
3  A04  GHI   DELHI  12

## 10. Drop a specific row or column from a DataFrame.

In [22]:
# Dropping 'City' column
result.drop('City',axis=1,inplace=True)
result

    id Name Age
2  A03  DEF  14
1  A02  PQR  13
0  A01  ABC  12
3  A04  GHI  12

In [25]:
# Dropping 0 row
result.drop(0,inplace=True)
result

    id Name Age
2  A03  DEF  14
1  A02  PQR  13
3  A04  GHI  12